Revit 2027 API
CableSize.OtherConductorSize Property
 The size of an Other Conductor.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId OtherConductorSize { get; set; }
Public Property OtherConductorSize As ElementId
	Get
	Set
public:
property ElementId^ OtherConductorSize {
	ElementId^ get ();
	void set (ElementId^ value);
}
member OtherConductorSize : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The id is not a Conductor Size id nor invalidElementId.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 Each Other Conductor has the same size.
See Also
Reference
CableSize Class
Autodesk.Revit.DB.Electrical Namespace